loadtest.yml
# Artillery Load Test Configuration
# npm install -g artillery
# artillery run loadtest.yml

config:
  target: 'http://localhost:8080'
  phases:
    - duration: 60
      arrivalRate: 20
scenarios:
  - flow:
      - get:
          url: "/"
      - get:
          url: "/slow"
      - get:
          url: "/random"